const site_list = [
    "全部(1171)",
    // "千岛湖镇(105)",
    "千岛湖风景区(271)",
    // "千岛湖东北湖区(41)",
    // "千岛湖北南湖区(17)",
    // "千岛湖西南湖区(5)",
    // "石林景区(21)",
    "明珠花园(29)",
    
    "阳光路(67)",
    // "富文乡(21)",
    "千岛湖广场(18)",
    "江滨公园(18)",
    "千岛湖森林氧吧(22)",
    "千岛湖绿城度假公寓(17)",
    "开发区(20)",
    
    "千岛湖水下古城(17)",
    "千岛湖十字街(12)",
    // "水下古城(8)",
    "客运中心(7)",
    
    "千岛湖大排档(4)",
    "湖滨公园(4)",
    "城厢(2)",
    "湖墅南路(1)",
    "新广场(1)",
    "杨村桥镇(1)",
    "淳安县其他(220)",
];
export {
    site_list
}
